---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.GetSpecificationAbbreviation(System.Int32)
source: html/bcb23a34-ee26-0c8e-5d79-4b9e45a4d927.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.GetSpecificationAbbreviation Method

Gets specification abbreviation.

## Syntax (C#)
```csharp
public string GetSpecificationAbbreviation(
	int specificationId
)
```

## Parameters
- **specificationId** (`System.Int32`) - The specification identifier.